.doom.d/readme.org
#+title: Doom Emacs Configuration
#+author: Aiden Schulman

* Table of Contents :toc:
- [[#init-file][Init File]]
- [[#appearance][Appearance]]
  - [[#cursor-highlighting][Cursor highlighting]]
- [[#org-mode][Org Mode]]
  - [[#default-org-directory][Default org directory]]
  - [[#disable-company-in-org-mode][Disable company in org mode]]
  - [[#icons-for-bullet-points-in-org-mode][Icons for bullet points in org mode]]
- [[#code-formatting][Code formatting]]
  - [[#python][Python]]

* Init File
This file controls what Doom modules are enabled and what order they load in.
#+begin_src elisp :tangle init.el
(doom! :input

       :completion
       company           ; the ultimate code completion backend
       vertico           ; the search engine of the future

       :ui
       doom              ; what makes DOOM look the way it does
       doom-dashboard    ; a splash screen for Emacs
       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
       modeline          ; snazzy, Atom-inspired modeline, plus API
       ophints           ; highlight the region an operation acts on
       (popup +defaults)   ; temporary windows
       tabs              ; a tab bar for Emacs
       treemacs          ; a project drawer, like neotree
       vc-gutter         ; vcs diff in the fringe
       vi-tilde-fringe   ; fringe tildes to mark beyond EOB
       workspaces        ; tab emulation, persistence & separate workspaces

       :editor
       (evil +everywhere)
       file-templates
       fold
       snippets

       :emacs
       dired             ; making dired pretty [functional]
       electric          ; smarter, keyword-based electric-indent
       undo              ; persistent, smarter undo
       vc                ; version-control

       :term
       vterm             ; the best terminal emulation in Emacs

       :checkers
       syntax

       :tools
       (eval +overlay)     ; run code, run (also, repls)
       lookup              ; navigate your code and its documentation
       lsp               ; M-x vscode
       magit             ; a git porcelain for Emacs

       :os
       (:if IS-MAC macos)  ; improve compatibility with macOS

       :lang
       (cc +lsp)
       emacs-lisp
       json
       (java +lsp)
       javascript
       lua
       markdown
       org
       python
       sh
       web

       :config
       (default +bindings +smartparens))
#+end_src
* Appearance
#+begin_src elisp :tangle config.el
(setq doom-theme 'doom-tokyo-night) ;; Theme
(setq display-line-numbers-type t) ;; Line numbers
(setq doom-font (font-spec :family "CaskaydiaCove Nerd Font" :size 17) ;; Font family
      doom-variable-pitch-font (font-spec :family "CaskaydiaCove Nerd Font" :size 17))
#+end_src
** Cursor highlighting
#+begin_src elisp :tangle packages.el
(package! beacon)
#+end_src
#+begin_src elisp :tangle config.el
(use-package! beacon)
(after! beacon (beacon-mode 1))
#+end_src

* Org Mode
** Default org directory
#+begin_src elisp :tangle config.el
(setq org-directory "~/org/")
#+end_src
** Disable company in org mode
#+begin_src elisp :tangle config.el
(after! org
  (remove-hook 'org-mode-hook #'auto-fill-mode)
  (setq company-global-modes '(not org-mode))
  )
#+end_src
** Icons for bullet points in org mode
#+begin_src elisp :tangle packages.el
(package! org-bullets)
#+end_src
#+begin_src elisp :tangle config.el
(require 'org-bullets)(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))) ;; Custom bullet point icons
#+end_src
* Code formatting
** Python
#+begin_src elisp :tangle packages.el
(package! python-black)
#+end_src
#+begin_src elisp :tangle config.el
(use-package! python-black
  :after python
  :hook (python-mode . python-black-on-save-mode-enable-dwim))
#+end_src
